数据库的索引结构设计成树形而不是使用Hash，原因是因为，SQL查询包括了很多的范围查询、排序查询，Hash结构查询效率会退化成O(n），而树结构的话还是O(lgn)

# B+树特征：
1、有K个子树的中间节点有K个元素，每一元素都不存储数据，只是用来进行索引，数据存储在叶子节点；
2、所有的叶子节点包含了全部的数据信息，以及指向这些数据的指针，叶子节点之间按照从小到大使用链表进行了连接；
3、所有的中间节点都存在于子节点，在子节点中是最大（最小）元素。

# B+树的优势：
1、单一节点存储更多元素，磁盘IO少；
2、叶子节点之间相互连接，便于范围查询；
3、每次查询都要到达叶子节点，查询稳定。


InnoDB与MyISAM的区别：（InnoDB : A | MyISAM : B）
1、A支持事务操作，B不支持
2、A支持外键，B不支持
3、B的SELECT语句查询速度比A快，A的UPDATE、INSERT语句比B快很多
4、B的Count操作速度比A快很多；
5、A是行级锁，B是表级锁
6、A的表格很难被压缩，B的表格可以被压缩；
7、B的索引和数据是分开的，并且索引是可以被压缩的，内存使用率比较高，A的索引和数据时紧密的，并且不可以被压缩，所以A的体积会比较大
8、A不支持全文类型索引，B支持全文索引


MyISAM的使用场景：1、查询频繁，修改少；2、做很多Count计算；3、不需要事务；
In弄DB的使用场景：1、可靠性要求比较高，要求事务；2、插入修改操作频繁，并发写入高
